# Pandas --(Python for data analysis)

In [3]:
import pandas as pd
import numpy as np

In [6]:
arr0 = np.array([[[[1,2,3,4,5]]]])
arr0

array([[[[1, 2, 3, 4, 5]]]])

In [7]:
arr0.ndim

4

In [ ]:
arr0.flatten() # flatten is for numpy only

array([1, 2, 3, 4, 5])

In [ ]:
np.ravel(arr0) # ravel for others also

array([1, 2, 3, 4, 5])

In [11]:
arr1 = pd.Series([1,22,3,4])
arr1

0     1
1    22
2     3
3     4
dtype: int64

In [18]:
arr2 = np.array([1,22,34,46,5])
arr3 = pd.Series(arr2)      #Data must be 1-dimensional
arr3

0     1
1    22
2    34
3    46
4     5
dtype: int64

In [17]:
arr3.ndim

1

In [ ]:
arr2 = np.array([[1,2,3,4,5]])
arr4 = pd.DataFrame(arr2) # Data must be 2 - dimensional
arr4

   0  1  2  3  4
0  1  2  3  4  5

In [22]:
arr5 = np.array([[1,2,3,4,],
                 [8,9,10,11]])
arr6 = pd.DataFrame(arr5)
arr6

   0  1   2   3
0  1  2   3   4
1  8  9  10  11

In [28]:
aa = {"name" : ["Ajay", "Vijay"], "Grade" : [6.7,8.8]} # asked in interview
aa

{'name': ['Ajay', 'Vijay'], 'Grade': [6.7, 8.8]}

In [29]:
bb = pd.DataFrame(aa)
bb

    name  Grade
0   Ajay    6.7
1  Vijay    8.8

In [25]:
# you can change the index of the dataFrame but not the dictionary
bb = pd.DataFrame(aa, index=["aa","bb"])
bb

     name  Grade
aa   Ajay    6.7
bb  Vijay    8.8

In [32]:
import seaborn as sns
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [31]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# Missing value treatment

df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [40]:
df1 = df.copy()
df1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
df1.shape #there are 688 deck missing values out of 891, so deleting them is best option

(891, 15)

In [43]:
del df1["deck"]

In [44]:
df1.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [ ]:
df1["age"].isnull().sum() #there are 177 deck missing values out of 891, so replace the mssing values with mean

np.int64(177)

In [47]:
df1["age"].mean()

np.float64(29.69911764705882)

In [50]:
df1["age"] = df1["age"].fillna(29.69)

In [51]:
df1["age"].isnull().sum()

np.int64(0)

In [52]:
df1.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [53]:
df1.rename({"class" : "Class"}, axis=1, inplace=True)

In [54]:
df1.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'Class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [55]:
df1.ndim

2

In [56]:
type(df1)

pandas.core.frame.DataFrame

In [57]:
df1.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.697306    0.523008    0.381594   32.204208
std      0.486592    0.836071   13.002016    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   22.000000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   29.690000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   35.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [58]:
df1["fare"].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: fare, dtype: float64

In [59]:
df1.describe(include="object")

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [ ]:
iris = sns.load_dataset("iris")
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [35]:
diamonds = sns.load_dataset("diamonds")
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [36]:
planets = sns.load_dataset("planets")
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009